Revit 2024 API
ParameterTypeId.StairsRunWinderEndWithStraight Property
 "End with Straight Run": Winder end with straight run
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsRunWinderEndWithStraight { get; }
Visual Basic
Public Shared ReadOnly Property StairsRunWinderEndWithStraight As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsRunWinderEndWithStraight {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace